zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT735S/MIMXRT735S_ezhv_COMMON.h
/* FRO - Peripheral instance base addresses */
/** Peripheral FRO0 base address */
#define FRO0_BASE                                (0x40001100u)
/** Peripheral FRO0 base pointer */
#define FRO0                                     ((FRO_Type *)FRO0_BASE)
/** Peripheral FRO1 base address */
#define FRO1_BASE                                (0x40001000u)
/** Peripheral FRO1 base pointer */
#define FRO1                                     ((FRO_Type *)FRO1_BASE)
/** Peripheral FRO2 base address */
#define FRO2_BASE                                (0x40061100u)
/** Peripheral FRO2 base pointer */
#define FRO2                                     ((FRO_Type *)FRO2_BASE)
/** Array initializer of FRO peripheral base addresses */
#define FRO_BASE_ADDRS                           { FRO0_BASE, FRO1_BASE, FRO2_BASE }
/** Array initializer of FRO peripheral base pointers */
#define FRO_BASE_PTRS                            { FRO0, FRO1, FRO2 }

/* GDET - Peripheral instance base addresses */
/** Peripheral GDET0 base address */
#define GDET0_BASE                               (0x40013000u)
/** Peripheral GDET0 base pointer */
#define GDET0                                    ((GDET_Type *)GDET0_BASE)
/** Peripheral GDET3 base address */
#define GDET3_BASE                               (0x4006B000u)
/** Peripheral GDET3 base pointer */
#define GDET3                                    ((GDET_Type *)GDET3_BASE)
/** Array initializer of GDET peripheral base addresses */
#define GDET_BASE_ADDRS                          { GDET0_BASE, 0u, 0u, GDET3_BASE }
/** Array initializer of GDET peripheral base pointers */
#define GDET_BASE_PTRS                           { GDET0, (GDET_Type *)0u, (GDET_Type *)0u, GDET3 }

/* GLIKEY - Peripheral instance base addresses */
/** Peripheral GLIKEY0 base address */
#define GLIKEY0_BASE                             (0x4017CC00u)
/** Peripheral GLIKEY0 base pointer */
#define GLIKEY0                                  ((GLIKEY_Type *)GLIKEY0_BASE)
/** Peripheral GLIKEY1 base address */
#define GLIKEY1_BASE                             (0x40220C00u)
/** Peripheral GLIKEY1 base pointer */
#define GLIKEY1                                  ((GLIKEY_Type *)GLIKEY1_BASE)
/** Peripheral GLIKEY2 base address */
#define GLIKEY2_BASE                             (0x40400C00u)
/** Peripheral GLIKEY2 base pointer */
#define GLIKEY2                                  ((GLIKEY_Type *)GLIKEY2_BASE)
/** Peripheral GLIKEY3 base address */
#define GLIKEY3_BASE                             (0x40002C00u)
/** Peripheral GLIKEY3 base pointer */
#define GLIKEY3                                  ((GLIKEY_Type *)GLIKEY3_BASE)
/** Peripheral GLIKEY4 base address */
#define GLIKEY4_BASE                             (0x40062C00u)
/** Peripheral GLIKEY4 base pointer */
#define GLIKEY4                                  ((GLIKEY_Type *)GLIKEY4_BASE)
/** Peripheral GLIKEY5 base address */
#define GLIKEY5_BASE                             (0x400A2C00u)
/** Peripheral GLIKEY5 base pointer */
#define GLIKEY5                                  ((GLIKEY_Type *)GLIKEY5_BASE)
/** Array initializer of GLIKEY peripheral base addresses */
#define GLIKEY_BASE_ADDRS                        { GLIKEY0_BASE, GLIKEY1_BASE, GLIKEY2_BASE, GLIKEY3_BASE, GLIKEY4_BASE, GLIKEY5_BASE }
/** Array initializer of GLIKEY peripheral base pointers */
#define GLIKEY_BASE_PTRS                         { GLIKEY0, GLIKEY1, GLIKEY2, GLIKEY3, GLIKEY4, GLIKEY5 }

/* GPIO - Peripheral instance base addresses */
/** Peripheral GPIO0 base address */
#define GPIO0_BASE                               (0x40100000u)
/** Peripheral GPIO0 base pointer */
#define GPIO0                                    ((GPIO_Type *)GPIO0_BASE)
/** Peripheral GPIO1 base address */
#define GPIO1_BASE                               (0x40102000u)
/** Peripheral GPIO1 base pointer */
#define GPIO1                                    ((GPIO_Type *)GPIO1_BASE)
/** Peripheral GPIO2 base address */
#define GPIO2_BASE                               (0x40104000u)
/** Peripheral GPIO2 base pointer */
#define GPIO2                                    ((GPIO_Type *)GPIO2_BASE)
/** Peripheral GPIO3 base address */
#define GPIO3_BASE                               (0x40106000u)
/** Peripheral GPIO3 base pointer */
#define GPIO3                                    ((GPIO_Type *)GPIO3_BASE)
/** Peripheral GPIO4 base address */
#define GPIO4_BASE                               (0x40108000u)
/** Peripheral GPIO4 base pointer */
#define GPIO4                                    ((GPIO_Type *)GPIO4_BASE)
/** Peripheral GPIO5 base address */
#define GPIO5_BASE                               (0x4010A000u)
/** Peripheral GPIO5 base pointer */
#define GPIO5                                    ((GPIO_Type *)GPIO5_BASE)
/** Peripheral GPIO6 base address */
#define GPIO6_BASE                               (0x4010C000u)
/** Peripheral GPIO6 base pointer */
#define GPIO6                                    ((GPIO_Type *)GPIO6_BASE)
/** Peripheral GPIO7 base address */
#define GPIO7_BASE                               (0x4010E000u)
/** Peripheral GPIO7 base pointer */
#define GPIO7                                    ((GPIO_Type *)GPIO7_BASE)
/** Peripheral GPIO8 base address */
#define GPIO8_BASE                               (0x40320000u)
/** Peripheral GPIO8 base pointer */
#define GPIO8                                    ((GPIO_Type *)GPIO8_BASE)
/** Peripheral GPIO9 base address */
#define GPIO9_BASE                               (0x40322000u)
/** Peripheral GPIO9 base pointer */
#define GPIO9                                    ((GPIO_Type *)GPIO9_BASE)
/** Peripheral GPIO10 base address */
#define GPIO10_BASE                              (0x40324000u)
/** Peripheral GPIO10 base pointer */
#define GPIO10                                   ((GPIO_Type *)GPIO10_BASE)
/** Peripheral GPIO0_ALIAS base address */
#define GPIO0_ALIAS_BASE                         (0x40101000u)
/** Peripheral GPIO0_ALIAS base pointer */
#define GPIO0_ALIAS                              ((GPIO_Type *)GPIO0_ALIAS_BASE)
/** Peripheral GPIO1_ALIAS base address */
#define GPIO1_ALIAS_BASE                         (0x40103000u)
/** Peripheral GPIO1_ALIAS base pointer */
#define GPIO1_ALIAS                              ((GPIO_Type *)GPIO1_ALIAS_BASE)
/** Peripheral GPIO2_ALIAS base address */
#define GPIO2_ALIAS_BASE                         (0x40105000u)
/** Peripheral GPIO2_ALIAS base pointer */
#define GPIO2_ALIAS                              ((GPIO_Type *)GPIO2_ALIAS_BASE)
/** Peripheral GPIO3_ALIAS base address */
#define GPIO3_ALIAS_BASE                         (0x40107000u)
/** Peripheral GPIO3_ALIAS base pointer */
#define GPIO3_ALIAS                              ((GPIO_Type *)GPIO3_ALIAS_BASE)
/** Peripheral GPIO4_ALIAS base address */
#define GPIO4_ALIAS_BASE                         (0x40109000u)
/** Peripheral GPIO4_ALIAS base pointer */
#define GPIO4_ALIAS                              ((GPIO_Type *)GPIO4_ALIAS_BASE)
/** Peripheral GPIO5_ALIAS base address */
#define GPIO5_ALIAS_BASE                         (0x4010B000u)
/** Peripheral GPIO5_ALIAS base pointer */
#define GPIO5_ALIAS                              ((GPIO_Type *)GPIO5_ALIAS_BASE)
/** Peripheral GPIO6_ALIAS base address */
#define GPIO6_ALIAS_BASE                         (0x4010D000u)
/** Peripheral GPIO6_ALIAS base pointer */
#define GPIO6_ALIAS                              ((GPIO_Type *)GPIO6_ALIAS_BASE)
/** Peripheral GPIO7_ALIAS base address */
#define GPIO7_ALIAS_BASE                         (0x4010F000u)
/** Peripheral GPIO7_ALIAS base pointer */
#define GPIO7_ALIAS                              ((GPIO_Type *)GPIO7_ALIAS_BASE)
/** Peripheral GPIO8_ALIAS base address */
#define GPIO8_ALIAS_BASE                         (0x40321000u)
/** Peripheral GPIO8_ALIAS base pointer */
#define GPIO8_ALIAS                              ((GPIO_Type *)GPIO8_ALIAS_BASE)
/** Peripheral GPIO9_ALIAS base address */
#define GPIO9_ALIAS_BASE                         (0x40323000u)
/** Peripheral GPIO9_ALIAS base pointer */
#define GPIO9_ALIAS                              ((GPIO_Type *)GPIO9_ALIAS_BASE)
/** Peripheral GPIO10_ALIAS base address */
#define GPIO10_ALIAS_BASE                        (0x40325000u)
/** Peripheral GPIO10_ALIAS base pointer */
#define GPIO10_ALIAS                             ((GPIO_Type *)GPIO10_ALIAS_BASE)
/** Array initializer of GPIO peripheral base addresses */
#define GPIO_BASE_ADDRS                          { GPIO0_BASE, GPIO1_BASE, GPIO2_BASE, GPIO3_BASE, GPIO4_BASE, GPIO5_BASE, GPIO6_BASE, GPIO7_BASE, GPIO8_BASE, GPIO9_BASE, GPIO10_BASE, GPIO0_ALIAS_BASE, GPIO1_ALIAS_BASE, GPIO2_ALIAS_BASE, GPIO3_ALIAS_BASE, GPIO4_ALIAS_BASE, GPIO5_ALIAS_BASE, GPIO6_ALIAS_BASE, GPIO7_ALIAS_BASE, GPIO8_ALIAS_BASE, GPIO9_ALIAS_BASE, GPIO10_ALIAS_BASE }
/** Array initializer of GPIO peripheral base pointers */
#define GPIO_BASE_PTRS                           { GPIO0, GPIO1, GPIO2, GPIO3, GPIO4, GPIO5, GPIO6, GPIO7, GPIO8, GPIO9, GPIO10, GPIO0_ALIAS, GPIO1_ALIAS, GPIO2_ALIAS, GPIO3_ALIAS, GPIO4_ALIAS, GPIO5_ALIAS, GPIO6_ALIAS, GPIO7_ALIAS, GPIO8_ALIAS, GPIO9_ALIAS, GPIO10_ALIAS }
/* Interrupt vectors for the GPIO peripheral type */


/* I2S - Peripheral instance base addresses */
/** Peripheral SAI0 base address */
#define SAI0_BASE                                (0x40152000u)
/** Peripheral SAI0 base pointer */
#define SAI0                                     ((I2S_Type *)SAI0_BASE)
/** Peripheral SAI1 base address */
#define SAI1_BASE                                (0x40153000u)
/** Peripheral SAI1 base pointer */
#define SAI1                                     ((I2S_Type *)SAI1_BASE)
/** Peripheral SAI2 base address */
#define SAI2_BASE                                (0x40154000u)
/** Peripheral SAI2 base pointer */
#define SAI2                                     ((I2S_Type *)SAI2_BASE)
/** Peripheral SAI3 base address */
#define SAI3_BASE                                (0x4031C000u)
/** Peripheral SAI3 base pointer */
#define SAI3                                     ((I2S_Type *)SAI3_BASE)
/** Array initializer of I2S peripheral base addresses */
#define I2S_BASE_ADDRS                           { SAI0_BASE, SAI1_BASE, SAI2_BASE, SAI3_BASE }
/** Array initializer of I2S peripheral base pointers */
#define I2S_BASE_PTRS                            { SAI0, SAI1, SAI2, SAI3 }

/* I3C - Peripheral instance base addresses */
/** Peripheral I3C0 base address */
#define I3C0_BASE                                (0x40037000u)
/** Peripheral I3C0 base pointer */
#define I3C0                                     ((I3C_Type *)I3C0_BASE)
/** Peripheral I3C1 base address */
#define I3C1_BASE                                (0x40038000u)
/** Peripheral I3C1 base pointer */
#define I3C1                                     ((I3C_Type *)I3C1_BASE)
/** Peripheral I3C2 base address */
#define I3C2_BASE                                (0x40056000u)
/** Peripheral I3C2 base pointer */
#define I3C2                                     ((I3C_Type *)I3C2_BASE)
/** Peripheral I3C3 base address */
#define I3C3_BASE                                (0x40057000u)
/** Peripheral I3C3 base pointer */
#define I3C3                                     ((I3C_Type *)I3C3_BASE)
/** Array initializer of I3C peripheral base addresses */
#define I3C_BASE_ADDRS                           { I3C0_BASE, I3C1_BASE, I3C2_BASE, I3C3_BASE }
/** Array initializer of I3C peripheral base pointers */
#define I3C_BASE_PTRS                            { I3C0, I3C1, I3C2, I3C3 }

/* INPUTMUX0 - Peripheral instance base addresses */
/** Peripheral INPUTMUX0 base address */
#define INPUTMUX0_BASE                           (0x40026000u)
/** Peripheral INPUTMUX0 base pointer */
#define INPUTMUX0                                ((INPUTMUX0_Type *)INPUTMUX0_BASE)
/** Array initializer of INPUTMUX0 peripheral base addresses */
#define INPUTMUX0_BASE_ADDRS                     { INPUTMUX0_BASE }
/** Array initializer of INPUTMUX0 peripheral base pointers */
#define INPUTMUX0_BASE_PTRS                      { INPUTMUX0 }

/* INPUTMUX1 - Peripheral instance base addresses */
/** Peripheral INPUTMUX1 base address */
#define INPUTMUX1_BASE                           (0x40046000u)
/** Peripheral INPUTMUX1 base pointer */
#define INPUTMUX1                                ((INPUTMUX1_Type *)INPUTMUX1_BASE)
/** Array initializer of INPUTMUX1 peripheral base addresses */
#define INPUTMUX1_BASE_ADDRS                     { INPUTMUX1_BASE }
/** Array initializer of INPUTMUX1 peripheral base pointers */
#define INPUTMUX1_BASE_PTRS                      { INPUTMUX1 }

/* IOPCTL0 - Peripheral instance base addresses */
/** Peripheral IOPCTL0 base address */
#define IOPCTL0_BASE                             (0x40004000u)
/** Peripheral IOPCTL0 base pointer */
#define IOPCTL0                                  ((IOPCTL0_Type *)IOPCTL0_BASE)
/** Array initializer of IOPCTL0 peripheral base addresses */
#define IOPCTL0_BASE_ADDRS                       { IOPCTL0_BASE }
/** Array initializer of IOPCTL0 peripheral base pointers */
#define IOPCTL0_BASE_PTRS                        { IOPCTL0 }

/* IOPCTL1 - Peripheral instance base addresses */
/** Peripheral IOPCTL1 base address */
#define IOPCTL1_BASE                             (0x40064000u)
/** Peripheral IOPCTL1 base pointer */
#define IOPCTL1                                  ((IOPCTL1_Type *)IOPCTL1_BASE)
/** Array initializer of IOPCTL1 peripheral base addresses */
#define IOPCTL1_BASE_ADDRS                       { IOPCTL1_BASE }
/** Array initializer of IOPCTL1 peripheral base pointers */
#define IOPCTL1_BASE_PTRS                        { IOPCTL1 }

/* IOPCTL2 - Peripheral instance base addresses */
/** Peripheral IOPCTL2 base address */
#define IOPCTL2_BASE                             (0x400A5000u)
/** Peripheral IOPCTL2 base pointer */
#define IOPCTL2                                  ((IOPCTL2_Type *)IOPCTL2_BASE)
/** Array initializer of IOPCTL2 peripheral base addresses */
#define IOPCTL2_BASE_ADDRS                       { IOPCTL2_BASE }
/** Array initializer of IOPCTL2 peripheral base pointers */
#define IOPCTL2_BASE_PTRS                        { IOPCTL2 }
/** Array initializer of IOPCTL peripheral base addresses */
  #define IOPCTL_BASE_ADDRS                        {IOPCTL0_BASE, IOPCTL1_BASE, IOPCTLR2_BASE}


/* JPGDECWRP - Peripheral instance base addresses */
/** Peripheral JPGDECWRP base address */
#define JPGDECWRP_BASE                           (0x400A6000u)
/** Peripheral JPGDECWRP base pointer */
#define JPGDECWRP                                ((JPGDECWRP_Type *)JPGDECWRP_BASE)
/** Array initializer of JPGDECWRP peripheral base addresses */
#define JPGDECWRP_BASE_ADDRS                     { JPGDECWRP_BASE }
/** Array initializer of JPGDECWRP peripheral base pointers */
#define JPGDECWRP_BASE_PTRS                      { JPGDECWRP }

/* LPI2C - Peripheral instance base addresses */
/** Peripheral LPI2C0 base address */
#define LPI2C0_BASE                              (0x40110800u)
/** Peripheral LPI2C0 base pointer */
#define LPI2C0                                   ((LPI2C_Type *)LPI2C0_BASE)
/** Peripheral LPI2C1 base address */
#define LPI2C1_BASE                              (0x40111800u)
/** Peripheral LPI2C1 base pointer */
#define LPI2C1                                   ((LPI2C_Type *)LPI2C1_BASE)
/** Peripheral LPI2C2 base address */
#define LPI2C2_BASE                              (0x40112800u)
/** Peripheral LPI2C2 base pointer */
#define LPI2C2                                   ((LPI2C_Type *)LPI2C2_BASE)
/** Peripheral LPI2C3 base address */
#define LPI2C3_BASE                              (0x40113800u)
/** Peripheral LPI2C3 base pointer */
#define LPI2C3                                   ((LPI2C_Type *)LPI2C3_BASE)
/** Peripheral LPI2C4 base address */
#define LPI2C4_BASE                              (0x40171800u)
/** Peripheral LPI2C4 base pointer */
#define LPI2C4                                   ((LPI2C_Type *)LPI2C4_BASE)
/** Peripheral LPI2C5 base address */
#define LPI2C5_BASE                              (0x40172800u)
/** Peripheral LPI2C5 base pointer */
#define LPI2C5                                   ((LPI2C_Type *)LPI2C5_BASE)
/** Peripheral LPI2C6 base address */
#define LPI2C6_BASE                              (0x40173800u)
/** Peripheral LPI2C6 base pointer */
#define LPI2C6                                   ((LPI2C_Type *)LPI2C6_BASE)
/** Peripheral LPI2C7 base address */
#define LPI2C7_BASE                              (0x40174800u)
/** Peripheral LPI2C7 base pointer */
#define LPI2C7                                   ((LPI2C_Type *)LPI2C7_BASE)
/** Peripheral LPI2C8 base address */
#define LPI2C8_BASE                              (0x40199800u)
/** Peripheral LPI2C8 base pointer */
#define LPI2C8                                   ((LPI2C_Type *)LPI2C8_BASE)
/** Peripheral LPI2C9 base address */
#define LPI2C9_BASE                              (0x4019A800u)
/** Peripheral LPI2C9 base pointer */
#define LPI2C9                                   ((LPI2C_Type *)LPI2C9_BASE)
/** Peripheral LPI2C10 base address */
#define LPI2C10_BASE                             (0x4019B800u)
/** Peripheral LPI2C10 base pointer */
#define LPI2C10                                  ((LPI2C_Type *)LPI2C10_BASE)
/** Peripheral LPI2C11 base address */
#define LPI2C11_BASE                             (0x4019C800u)
/** Peripheral LPI2C11 base pointer */
#define LPI2C11                                  ((LPI2C_Type *)LPI2C11_BASE)
/** Peripheral LPI2C12 base address */
#define LPI2C12_BASE                             (0x4019D800u)
/** Peripheral LPI2C12 base pointer */
#define LPI2C12                                  ((LPI2C_Type *)LPI2C12_BASE)
/** Peripheral LPI2C13 base address */
#define LPI2C13_BASE                             (0x4019E800u)
/** Peripheral LPI2C13 base pointer */
#define LPI2C13                                  ((LPI2C_Type *)LPI2C13_BASE)
/** Peripheral LPI2C15 base address */
#define LPI2C15_BASE                             (0x40213000u)
/** Peripheral LPI2C15 base pointer */
#define LPI2C15                                  ((LPI2C_Type *)LPI2C15_BASE)
/** Peripheral LPI2C17 base address */
#define LPI2C17_BASE                             (0x40326800u)
/** Peripheral LPI2C17 base pointer */
#define LPI2C17                                  ((LPI2C_Type *)LPI2C17_BASE)
/** Peripheral LPI2C18 base address */
#define LPI2C18_BASE                             (0x40327800u)
/** Peripheral LPI2C18 base pointer */
#define LPI2C18                                  ((LPI2C_Type *)LPI2C18_BASE)
/** Peripheral LPI2C19 base address */
#define LPI2C19_BASE                             (0x40328800u)
/** Peripheral LPI2C19 base pointer */
#define LPI2C19                                  ((LPI2C_Type *)LPI2C19_BASE)
/** Peripheral LPI2C20 base address */
#define LPI2C20_BASE                             (0x40329800u)
/** Peripheral LPI2C20 base pointer */
#define LPI2C20                                  ((LPI2C_Type *)LPI2C20_BASE)
/** Array initializer of LPI2C peripheral base addresses */
#define LPI2C_BASE_ADDRS                         { LPI2C0_BASE, LPI2C1_BASE, LPI2C2_BASE, LPI2C3_BASE, LPI2C4_BASE, LPI2C5_BASE, LPI2C6_BASE, LPI2C7_BASE, LPI2C8_BASE, LPI2C9_BASE, LPI2C10_BASE, LPI2C11_BASE, LPI2C12_BASE, LPI2C13_BASE, 0u, LPI2C15_BASE, 0u, LPI2C17_BASE, LPI2C18_BASE, LPI2C19_BASE, LPI2C20_BASE }
/** Array initializer of LPI2C peripheral base pointers */
#define LPI2C_BASE_PTRS                          { LPI2C0, LPI2C1, LPI2C2, LPI2C3, LPI2C4, LPI2C5, LPI2C6, LPI2C7, LPI2C8, LPI2C9, LPI2C10, LPI2C11, LPI2C12, LPI2C13, (LPI2C_Type *)0u, LPI2C15, (LPI2C_Type *)0u, LPI2C17, LPI2C18, LPI2C19, LPI2C20 }

