zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT735S/MIMXRT735S_ezhv_COMMON.h
/* LP_FLEXCOMM - Peripheral instance base addresses */
/** Peripheral LP_FLEXCOMM0 base address */
#define LP_FLEXCOMM0_BASE                        (0x40110000u)
/** Peripheral LP_FLEXCOMM0 base pointer */
#define LP_FLEXCOMM0                             ((LP_FLEXCOMM_Type *)LP_FLEXCOMM0_BASE)
/** Peripheral LP_FLEXCOMM1 base address */
#define LP_FLEXCOMM1_BASE                        (0x40111000u)
/** Peripheral LP_FLEXCOMM1 base pointer */
#define LP_FLEXCOMM1                             ((LP_FLEXCOMM_Type *)LP_FLEXCOMM1_BASE)
/** Peripheral LP_FLEXCOMM2 base address */
#define LP_FLEXCOMM2_BASE                        (0x40112000u)
/** Peripheral LP_FLEXCOMM2 base pointer */
#define LP_FLEXCOMM2                             ((LP_FLEXCOMM_Type *)LP_FLEXCOMM2_BASE)
/** Peripheral LP_FLEXCOMM3 base address */
#define LP_FLEXCOMM3_BASE                        (0x40113000u)
/** Peripheral LP_FLEXCOMM3 base pointer */
#define LP_FLEXCOMM3                             ((LP_FLEXCOMM_Type *)LP_FLEXCOMM3_BASE)
/** Peripheral LP_FLEXCOMM4 base address */
#define LP_FLEXCOMM4_BASE                        (0x40171000u)
/** Peripheral LP_FLEXCOMM4 base pointer */
#define LP_FLEXCOMM4                             ((LP_FLEXCOMM_Type *)LP_FLEXCOMM4_BASE)
/** Peripheral LP_FLEXCOMM5 base address */
#define LP_FLEXCOMM5_BASE                        (0x40172000u)
/** Peripheral LP_FLEXCOMM5 base pointer */
#define LP_FLEXCOMM5                             ((LP_FLEXCOMM_Type *)LP_FLEXCOMM5_BASE)
/** Peripheral LP_FLEXCOMM6 base address */
#define LP_FLEXCOMM6_BASE                        (0x40173000u)
/** Peripheral LP_FLEXCOMM6 base pointer */
#define LP_FLEXCOMM6                             ((LP_FLEXCOMM_Type *)LP_FLEXCOMM6_BASE)
/** Peripheral LP_FLEXCOMM7 base address */
#define LP_FLEXCOMM7_BASE                        (0x40174000u)
/** Peripheral LP_FLEXCOMM7 base pointer */
#define LP_FLEXCOMM7                             ((LP_FLEXCOMM_Type *)LP_FLEXCOMM7_BASE)
/** Peripheral LP_FLEXCOMM8 base address */
#define LP_FLEXCOMM8_BASE                        (0x40199000u)
/** Peripheral LP_FLEXCOMM8 base pointer */
#define LP_FLEXCOMM8                             ((LP_FLEXCOMM_Type *)LP_FLEXCOMM8_BASE)
/** Peripheral LP_FLEXCOMM9 base address */
#define LP_FLEXCOMM9_BASE                        (0x4019A000u)
/** Peripheral LP_FLEXCOMM9 base pointer */
#define LP_FLEXCOMM9                             ((LP_FLEXCOMM_Type *)LP_FLEXCOMM9_BASE)
/** Peripheral LP_FLEXCOMM10 base address */
#define LP_FLEXCOMM10_BASE                       (0x4019B000u)
/** Peripheral LP_FLEXCOMM10 base pointer */
#define LP_FLEXCOMM10                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM10_BASE)
/** Peripheral LP_FLEXCOMM11 base address */
#define LP_FLEXCOMM11_BASE                       (0x4019C000u)
/** Peripheral LP_FLEXCOMM11 base pointer */
#define LP_FLEXCOMM11                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM11_BASE)
/** Peripheral LP_FLEXCOMM12 base address */
#define LP_FLEXCOMM12_BASE                       (0x4019D000u)
/** Peripheral LP_FLEXCOMM12 base pointer */
#define LP_FLEXCOMM12                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM12_BASE)
/** Peripheral LP_FLEXCOMM13 base address */
#define LP_FLEXCOMM13_BASE                       (0x4019E000u)
/** Peripheral LP_FLEXCOMM13 base pointer */
#define LP_FLEXCOMM13                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM13_BASE)
/** Peripheral LP_FLEXCOMM17 base address */
#define LP_FLEXCOMM17_BASE                       (0x40326000u)
/** Peripheral LP_FLEXCOMM17 base pointer */
#define LP_FLEXCOMM17                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM17_BASE)
/** Peripheral LP_FLEXCOMM18 base address */
#define LP_FLEXCOMM18_BASE                       (0x40327000u)
/** Peripheral LP_FLEXCOMM18 base pointer */
#define LP_FLEXCOMM18                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM18_BASE)
/** Peripheral LP_FLEXCOMM19 base address */
#define LP_FLEXCOMM19_BASE                       (0x40328000u)
/** Peripheral LP_FLEXCOMM19 base pointer */
#define LP_FLEXCOMM19                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM19_BASE)
/** Peripheral LP_FLEXCOMM20 base address */
#define LP_FLEXCOMM20_BASE                       (0x40329000u)
/** Peripheral LP_FLEXCOMM20 base pointer */
#define LP_FLEXCOMM20                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM20_BASE)
/** Array initializer of LP_FLEXCOMM peripheral base addresses */
#define LP_FLEXCOMM_BASE_ADDRS                   { LP_FLEXCOMM0_BASE, LP_FLEXCOMM1_BASE, LP_FLEXCOMM2_BASE, LP_FLEXCOMM3_BASE, LP_FLEXCOMM4_BASE, LP_FLEXCOMM5_BASE, LP_FLEXCOMM6_BASE, LP_FLEXCOMM7_BASE, LP_FLEXCOMM8_BASE, LP_FLEXCOMM9_BASE, LP_FLEXCOMM10_BASE, LP_FLEXCOMM11_BASE, LP_FLEXCOMM12_BASE, LP_FLEXCOMM13_BASE, 0u, 0u, 0u, LP_FLEXCOMM17_BASE, LP_FLEXCOMM18_BASE, LP_FLEXCOMM19_BASE, LP_FLEXCOMM20_BASE }
/** Array initializer of LP_FLEXCOMM peripheral base pointers */
#define LP_FLEXCOMM_BASE_PTRS                    { LP_FLEXCOMM0, LP_FLEXCOMM1, LP_FLEXCOMM2, LP_FLEXCOMM3, LP_FLEXCOMM4, LP_FLEXCOMM5, LP_FLEXCOMM6, LP_FLEXCOMM7, LP_FLEXCOMM8, LP_FLEXCOMM9, LP_FLEXCOMM10, LP_FLEXCOMM11, LP_FLEXCOMM12, LP_FLEXCOMM13, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, LP_FLEXCOMM17, LP_FLEXCOMM18, LP_FLEXCOMM19, LP_FLEXCOMM20 }
#define LP_FLEXCOMM_IRQS                         { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn }


/* MIPI_DSI_HOST - Peripheral instance base addresses */
/** Peripheral MIPI_DSI_HOST base address */
#define MIPI_DSI_HOST_BASE                       (0x40417000u)
/** Peripheral MIPI_DSI_HOST base pointer */
#define MIPI_DSI_HOST                            ((MIPI_DSI_HOST_Type *)MIPI_DSI_HOST_BASE)
/** Array initializer of MIPI_DSI_HOST peripheral base addresses */
#define MIPI_DSI_HOST_BASE_ADDRS                 { MIPI_DSI_HOST_BASE }
/** Array initializer of MIPI_DSI_HOST peripheral base pointers */
#define MIPI_DSI_HOST_BASE_PTRS                  { MIPI_DSI_HOST }

